## Staging: load_balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| add    | `aws_lb.saas_procurement`                              |
|        | `aws_lb_listener.saas_procurement_listener`            |
|        | `aws_lb_target_group.saas_procurement`                 |
|        | `aws_security_group.saas_procurement_load_balancer_sg` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.saas_procurement will be created
  + resource "aws_lb" "saas_procurement" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = true
      + enable_deletion_protection                  = true
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "saas-procurement-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-01a482ab028dbb38a",
          + "subnet-0458b13f2b680703f",
          + "subnet-0d76fea2786c5d960",
        ]
      + tags                                        = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                                    = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.saas_procurement_listener will be created
  + resource "aws_lb_listener" "saas_procurement_listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ca-central-1:394954348146:certificate/2515ca66-51aa-407d-9a4d-6f86b86f27bb"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2020-10"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.saas_procurement will be created
  + resource "aws_lb_target_group" "saas_procurement" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "saas-procurement"
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all                           = {
          + "CostCentre" = "saas-procurement"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-04ac29c4ad6b4676e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 10
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_security_group.saas_procurement_load_balancer_sg will be created
  + resource "aws_security_group" "saas_procurement_load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = "Security group of the Load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "saas_procurement_load_balancer_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all               = {
          + "CostCentre" = "saas-procurement"
        }
      + vpc_id                 = "vpc-04ac29c4ad6b4676e"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ lb_listener                       = {
      ~ arn               = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:listener/app/saas-procurement-alb/6b848f609a5867eb/3b73fa84f5ab8e32" -> (known after apply)
      ~ default_action    = [
          ~ {
              ~ order                = 1 -> (known after apply)
              ~ target_group_arn     = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/c0caf8eb8e958ee9" -> (known after apply)
                # (6 unchanged elements hidden)
            },
        ]
      ~ id                = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:listener/app/saas-procurement-alb/6b848f609a5867eb/3b73fa84f5ab8e32" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:loadbalancer/app/saas-procurement-alb/6b848f609a5867eb" -> (known after apply)
      ~ tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (6 unchanged elements hidden)
    }
  ~ lb_target_group_arn               = "arn:aws:elasticloadbalancing:ca-central-1:394954348146:targetgroup/saas-procurement/c0caf8eb8e958ee9" -> (known after apply)
  + saas_procurement_load_balancer_sg = {
      + arn                    = (known after apply)
      + description            = "Security group of the Load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "saas_procurement_load_balancer_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "saas-procurement"
        }
      + tags_all               = {
          + "CostCentre" = "saas-procurement"
        }
      + timeouts               = null
      + vpc_id                 = "vpc-04ac29c4ad6b4676e"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.saas_procurement_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.saas_procurement"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.saas_procurement_load_balancer_sg"]

22 tests, 17 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
